[
    {
        "docs": {
            "ar_exe":"The path to the AutoRoute executable file. This is used to run the main input file.",
            "stream_file":"The card and associated file name tell AutoRoute what stream raster to use. The stream raster is typically a file where a stream netowkr has been rasterized to the same extent and resolution as the dem, with the values being the IDs of the stream segments, and 0 everywhere else.",
            "spatial_unit":"Spatial units of the x- and y- coordinates in the input rasters.",
            "latitude":"Latitude in degrees of the center of area being modeled (i.e. the center of the raster inputs) Latitude value should always be positive…. For a latitude of -35.65 put 35.65 Update to AutoRoute Version 2.0.  If the “Latitude” card is not present when using geographic coordinates (“deg”) the AutoRoute model will calculate the central latitude of the elevation raster and use that latitude in the calculations.  Although you can still define “Latitude”, it is no longer necessary with AutoRoute Version 2.0 and greater.",
            "x_distance":"This is the distance (meters) from the stream cell that will be sampled from the DEM to create a cross-section profile. A value of 100 would indicate that 200 meters would be sampled (100 meters on each side of the stream cell).Higher values are needed for wide rivers, but with these larger values also comes computational burden. It is really up the modeler to balance the need for sampling wide cross sections with the computational cost.",
            "q_limit":"AutoRoute uses an iterative method to calculate the flow depth at each cross-section. The flow depth is iteratively increased until the calculated flow rate (Qcalc) is similar to the flow rate assigned to the stream cell (Qassigned). The cross-section is not used if Qcalc > Q_Limit * Qassigned Default value for Q_Limit is 1.1.  This means that if the Qcalc is 10% higher than Qassigned the cross-section is thrown out.  Some detail is provided in Follum et al. (2020), but in that paper Q_Limit is set to 1.01, which would throw out more cross-sections.",
            "use_prev_d_4_xs":"The value is either 0 or 1. If this card is specified with a value of 1 and a cross-section is going to be thrown out because Qcalc > Q_Limit * Qassigned, , the previous depth value (which didn’t violate the Q_Limit criteria) is used for the cross-section.  However, Qcalc could be less (significantly less sometimes) than Qassigned. This option should almost always be used and therefore the default value is now set to 1.",
            "man_n":"Specifies the Mannings n value for the entire model\nThis is overwritten if a Land Use raster is defined and a Mannings n table is utilized (see LU_Manning_n and LU_Raster or LU_Raster_SameRes)",
            "lu_file":"This is either a Land Use raster that has a spatial resolution and spatial extent the EXACT SAME as the DEM and Stream Raster files, or this is a Land Use raster that has a spatial resolution and spatial extent greater than the DEM or Stream raster files.This option was included because land use rasters are typically 30m resolution and DEM rasters are typically 10m resolution.  It also allows the modeler to use a single land use raster when simulating a large area that is made-up of several DEM rasters.The values of the land use raster must be integers between 0 and 100.",
            "LU_Manning_n":"Tab seperated table that corresponds a land use type to a Mannings n value. Each cell within the model is assigned a Mannings n value. Each row is as follows: Land_use_value{tab}Description{tab}mannings_n{newline}. A header row is expected",
            "Gen_Dir_Dist": "This is the number of cells upstream and downstream the model will search to calculate the stream direction for each stream cell. The cross-sections are sampled from angles perpendicular to the stream direction. Based on sinuosity of the rivers, this is really up to the modeler to determine the appropriate value. Default value is 1, but is often set to 10 depending on the model application.",
            "Gen_Slope_Dist":"This is the number of cells upstream and downstream the model will search to calculate the stream slope for each stream cell. This is really up to the modeler to determine the appropriate value. Default value is 1, but is often set to 10 depending on the model application.",
            "Weight_Angles":"For calculating slope and stream direction it was thought at one time the stream cells farther upstream/downstream from the stream cell of interest should carry a different weight than those that are closer. A value greater than 0 would increase the weight of cells farther from the stream cell of interest. Default value is 0, which would apply no weight based on distance from the cell.",
            "limit_vals":"Restrict model to only simulate values in the stream raster between the below two numbers. This is useful in omitting certain stream reaches. Also useful when simulating flows when the input stream raster is a flow accumulation raster.",
            "degree":"Degree Manip and Degree_Interval are both inputs that represent an angle in degrees.  Both inputs are required for model to sample additional cross-sections at each stream cell. Degree Manip in conjunction with Degree_Interval are used to more accurately capture a cross-section perpendicular to the stream direction. As described in Follum et al. (2007), AutoRoute samples an initial cross-section. Degree_Manip is the maximum angle (in degrees) that the cross-sections will pivot to either side of the original cross-section.  Degree_Interval (in degrees) specifies the incremental pivots about the original cross-section. Default value is 0.0, meaning no additional cross-sections are sampled.  Although not official, a typical value for Degree_Manip is 6.0 (degrees) and a typical value for Degree_Interval is 1.5 (degrees).",
            "Low_Spot_Range":"Tells AutoRoute to search for a low-spot in the cross-section profile.  The value associated with the parameter is the number of ordinates laterally along the cross-section or distance in meters (if in meters is selected) searched to find the lowest point within the cross-section.  This parameter is often needed because the specified stream cell location is not always the lowest point within the cross-section.  The user needs to be aware as to not make this value too large because it is possible a low spot outside of the river channel could be found if the search distance is too large. If several cells have the lowest elevation analyzed, the cell closest to the modeled stream line is utilized. The default value is 2",
            "Low_Spot_Find_Flat": "n many elevation datasets the elevations of large rivers are “burned-in”, giving them uniform elevations. The rivers may not have the lowest elevation within the cross-section profile, but they can be identified because they have a constant elevation.  The “Low_Spot_Find_Flat” input card was added to AutoRoute to help identify the centerline of larger rivers.  This feature only works when a stream line has a flow rate greater than a user-specified flow rate (“Low_Spot_Range_FlowCutoff”) which allows only larger rivers to implement the “Low_Spot_Find_Flat” method.  In the “Low_Spot_Find_Flat” method a cross-section is sampled and the model analyzes the 20 closest ordinates to the modeled centerline.  If several of the ordinates have the same elevation it is assumed this area of “flat” cells is a river and the centerline is moved to the center of these flat cells.",
            "vdt":"Output file that for each stream cell it prints either 1) the stream identifier (COMID, HydroID, etc.), row, col, flow, velocity, depth, top-width, elevation, and water surface elevation, or 2) stream identifier (COMID, HydroID, etc.), row, col, elevation, baseflow, and for several flow rates the flow, velocity, top-width, and water surface elevation associated IF this is a database. This output file is used as an input for FloodSpreader.",
            "num_iterations":"When using the “Print_VDT_Database” option the AutoRoute model is simulating several flow rates and recording the information in an output VDT database file.  This input card allows the user to define how many flow iterations are simulated.  The default value is 15.",
            "Flow_RAPIDFile":"Input text file that specifies for each stream cell the row, col, HydroID (or similar COMID, etc.), and flow rates.  In the file you can specify several flow rates for each stream cell.  The Flow_File is tab- or space-separated and is typically created in a preprocessing step.  An example Flow_File is shown below:",
            "RowCol_From_RAPIDFile":"The row and column for each stream cell is defined within the Flow_RAPIDFile file by the Row and Col headings.  If this card is not present then the model will use the Stream_File to define the row and column of each stream cell.",
            "Bathymetry":"AutoRoute will estimate channel bathymetry using a power function",
            "Bathymetry_Alpha":"Allows the user to manually specify ẟ in the bathymetry power function.  Default ẟ value is 0.001.",
            "Layer_Row_Start":"This card specifies the row where the AutoRoute model will start sampling cross-sections and simulating flood events.  This option was implemented to save computational time by only simulating a smaller zone.  The default value is 0.0",
            "Layer_Row_End":"This card specifies the row where the AutoRoute model will stop sampling cross-sections and simulating flood events.  This option was implemented to save computational time by only simulating a smaller zone.  The default value is set to the total number of rows.",
            "ADJUST_FLOW_BY_FRACTION":"The flow rate that is inputted or calculated is simply multiplied by the specified ADJUST_FLOW_BY_FRACTION value.  If the Calculated flow value for a given cell is 50.2 cms and  ADJUST_FLOW_BY_FRACTION is set to 0.75, then the model will try to simulate a flow rate of 37.65 cms.",
            "BATHY_Out_File":"The full path to an output raster file of the AutoRoute-generated bathymetry.  All cells that were not included in cross-sections have a value of 0.  The main purpose of this file is as an input into FloodSpreader to create a more complete bathymetric map.",
            "Meta_File":"A metafile is written for every AutoRoute run.  The information includes the AutoRoute version used, the location and size of the rasters being used, the inputs that were chosen, simulation time, etc.  If no filename is given, the program defaults to using “Report_Log.txt”.  This input card lets you specify the name of the Meta File.",
            "Comid_Flow_File":"This card and associated file are used in conjunction with the Print_VDT_Database card.  The Comid_Flow_File simply lists the stream identifiers (i.e. COMID, HydroID) with their associated flow in cms.  The file is comma delimited.",
            "fs_bathy_file":"The full path to the FloodSpreader-generated bathymetry.  As you can see, the bathymetry is burned into the original DEM data.  ",
            "smooth_wse":"Tells FloodSpreader to omit outliers using a spatial averaging method",
            "Flood_BadCells":"If the Top Width or Depth value associated with a cell is less than 1e-16 and the Flood_BadCells flag is specified, then the Depth and Top Width used in the cell is set to the average for the stream identifier (basically the stream reach).  This option was included to omit outliers but has NOT proven to be very useful.",
            "FloodSpreader_Use_AR_Depths":"Uses the flow depths values originally read-in from the VDT File",
            "wse_search_dist":"An optional input card that specifies the proximity in which water surface elevation (WSE) values are analyzed.  The default value is 10, meaning that WSE values in a box 10 cells above, below, to the left, and to the right will be analyzed.  In total, stream cells within a 441 cell box (stream cell being analyzed is omitted) are analyzed to determine the mean and standard deviation of the WSE.",
            "wse_threshold":"An optional input card that specifies the threshold in which a WSE value is adjusted.  The default value is 0.25, meaning that if the WSE of the stream cell being analyzed is outside of 0.25 standard deviations from the mean it is adjusted.  For example, if the mean WSE of surrounding cells is 156.5 m and the SD for that stream reach is 3.2 m: If the WSE of the stream cell being analyzed is 157.2 m, it will remain 157.2 m. If the WSE of the stream cell being analyzed is 159.5 m, it will be adjusted to 157.3 m (156.5m + 0.25 * 3.2m). If the WSE of the stream cell being analyzed is 154.2 m, it will be adjusted to 155.7 m (156.5m - 0.25 * 3.2m)",
            "wse_remove_three":"An optional input card that removes the highest 3 flow elevations in the search radius.  This was a test to remove outliers.  This option did not work well for a testcase in Croatia, and should not be used until it has shown to be beneficial.",
            "FloodSpreader_Use_AR_Depths_StDev":"In an effort to remove outliers, this flag tells FloodSpreader to set the depth and topwidth values of a stream cell to the average for the stream identifier if the value is outside of one standard deviation.  This option has never worked well. ",
            "FloodSpreader_SpecifyDepth":"Optional input card that tells FloodSpreader to set a uniform depth for all stream cells.",
            "twd_factor":"As discussed in Follum et al., (2020), higher TopWidthDistanceFactor (α) values increase the impact that each stream cell has on surrounding cells when generating a flood inundation map using FloodSpreader. The paper tested several α values and found higher α values resulted in increased accuracy but also increased the computational burden. The paper found α=1.5 provided good coverage of the river floodplain while remaining computationally efficient.  However, those tests were performed at sites in the U.S. using floating-point elevation datasets.  The α value has a default value of 1.5.",
            "only_streams":"Outputs values in the output rasters for only the stream cells.",
            "use_ar_top_widths":"Uses the top width values originally read-in from the VDT File (Print_VDT). Default is to use the average top width value for the stream identifier.",
            "FloodLocalOnly":"Unknown what this does, but Mike likes to use it.",
            "out_depth":"Output depth (m) map from FloodSpreader.  Cells that are not considered flooded have a value of 0.",
            "out_flood":"Output flood map from FloodSpreader.  Cells that are not considered flooded have a value of 0.",
            "out_velocity":"Output flow velocity (m/s) map from FloodSpreader. Cells that are not considered flooded have a value of 0.",
            "out_wse":"Output water surface depth (m) map from FloodSpreader.  Cells that are not considered flooded have the value from the DEM (DEM_File).",
            "RAPID_DA_or_Flow_Param":"Highly recommended when using left bank- or right bank quadratic bathymetric profile. This card helps AutoRoute know the left bank and the right bank of a stream.  This allows for constant bathymetric profiles, especially when using a left bank quadratic or right bank quadratic bathymetric profile. The text (String) must be present as a column heading in the Flow_RAPIDFile file. AutoRoute tries to use the Stream Raster (“Stream_File” input card) to determine the left and right banks.  However, it can sometimes be difficult to determine the interconnections of stream. The String associated with the input card relates to a column-field in the input flow file (“Flow_RAPIDFile” input card).  The column-field should be populated with a value specific to each stream reach that represents a flow rate or, preferably, the total drainage area of the stream reach.",
            "bathy_method":"The shape of the bathymtery. Default is parabolic",
            "bathy_x_max_depth":"The value associated with Bathymetry_XMaxDepth tells the model what percentage of the top width from the bank that the lowest elevation of the bathymetry profile begins (see figure below). Applies to trapezoidal, left bank quadratic, right bank quadratic, and double quadratic bathymetric profiles.",
            "bathy_y_shallow": "The shallow portion of the bathymetric profile is calculated as the maximum depth times the value associated with Bathymetry_YShallow (see figure below). Applies to left bank quadratic, right bank quadratic, and double quadratic bathymetric profiles."
        },
        "data": {
            "ar_exe":"",
            "stream_file":"",
            "inital_path":"/",
            "i1":false,
            "i2":false,
            "i3":false,
            "i4":false,
            "i5":false,
            "i6":false,
            "i7":false,
            "i8":false,
            "i9":false,
            "i10":false,
            "i11":false,
            "i12":false,
            "i13":false,
            "i14":false,
            "i15":false,
            "i16":false,
            "i17":false,
            "i18":false,
            "i19":false,
            "i20":false,
            "i21":false,
            "spatial_unit":"deg",
            "latitude":"",
            "x_distance":500,
            "q_limit": 1.1,
            "use_prev_d_4_xs": 1,
            "man_n":"",
            "lu_file":"",
            "is_lu_sameres":true
        }
    }
]